import json
import os

str = '''
{
  "标题": "石帅之龙女情深",
  "核心角色": [
    {
      "名字": "石帅",
      "性格描述以及背景": "石帅，武学天才，本身没有任何功力的平凡人，却对小龙女恋恋不忘，决心在金庸的武侠世界中迎娶她。"
    },
    {
      "名字": "小龙女",
      "性格描述以及背景": "小龙女出身神秘，习得古墓派所有武功，冷傲孤僻，但是内心深处有一丝温情，欣赏石帅的毅力和坚韧。"
    },
    {
      "名字": "杨过",
      "性格描述以及背景": "杨过，神雕侠侣，武艺超群，深爱小龙女，是石帅的主要情敌。"
    }
  ],
  "剧情概要": "石帅以普通人的身份踏入了金庸的武侠世界，他对小龙女的深情让他立下誓言要迎娶她。然而在这其中，他要打败情敌杨过，这一切都需要他不断历练，提升实力。",
  "章节划分": {
    "第一章": {
      "章节标题": "踏入江湖",
      "角色": ["石帅"],
      "故事线": "石帅由于某种契机，踏入了金庸武侠世界，他对小龙女一见倾心，并下定决心要迎娶她，开启自己的江湖历程。"
    },
    "第二章": {
      "章节标题": "初遇情敌",
      "角色": ["石帅", "小龙女", "杨过"],
      "故事线": "石帅在追求小龙女的过程中，遇见了杨过，杨过与小龙女深厚的感情，让石帅的路更为艰难。"
    },
    "第三章": {
      "章节标题": "历练自我",
      "角色": ["石帅"],
      "故事线": "石帅见识到杨过的实力后，决定历练自我，提升实力，他在江湖中遭遇各种困难，但仍不放弃，坚持下去。"
    },
    "第四章": {
      "章节标题": "再战杨过",
      "角色": ["石帅", "杨过"],
      "故事线": "经过一段时间的历练，石帅的实力有所提升，他再次与杨过交手，虽然仍然不能打败杨过，但已有所进步。"
    },
    "第五章": {
      "章节标题": "心动小龙女",
      "角色": ["石帅", "小龙女"],
      "故事线": "石帅的坚韧和毅力打动了小龙女，小龙女对石帅产生了好感，石帅的追求得到了回应。"
    },
    "第六章": {
      "章节标题": "最终对决",
      "角色": ["石帅", "杨过", "小龙女"],
      "故事线": "石帅再次与杨过对决，凭借自己的坚韧不拔，终于有了与杨过一战的实力，成功打败杨过，迎娶小龙女。"
    }
  }
}
'''




if __name__ == '__main__':
    # data = outline2dict(str)
    json_obj = json.loads(str)
    filename = "data.json"
    with open('data.json', 'w', encoding='utf-8') as f:
        json.dump(json_obj, f, ensure_ascii=False, indent=4)
    with open('data.json', 'r') as file:
        data = json.load(file)
    print(data)
    # for key, value in data["章节划分"].items():
    #     print(key, value)
    print(data["章节划分"].geti)



